{
	"class": [
		{
			"name": "Artificer",
			"source": "KCAA",
			"page": 42,
			"hd": {
				"number": 1,
				"faces": 8
			},
			"proficiency": [
				"int",
				"wis"
			],
			"classTableGroups": [
				{
					"colLabels": [
						"{@filter Cantrips Known|spells|level=0|class=Artificer}"
					],
					"rows": [
						[
							3
						],
						[
							3
						],
						[
							3
						],
						[
							4
						],
						[
							4
						],
						[
							4
						],
						[
							4
						],
						[
							4
						],
						[
							4
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						]
					]
				},
				{
					"title": "Spell Slots per Spell Level",
					"colLabels": [
						"{@filter 1st|spells|level=1|class=Artificer}",
						"{@filter 2nd|spells|level=2|class=Artificer}",
						"{@filter 3rd|spells|level=3|class=Artificer}",
						"{@filter 4th|spells|level=4|class=Artificer}",
						"{@filter 5th|spells|level=5|class=Artificer}",
						"{@filter 6th|spells|level=6|class=Artificer}",
						"{@filter 7th|spells|level=7|class=Artificer}",
						"{@filter 8th|spells|level=8|class=Artificer}",
						"{@filter 9th|spells|level=9|class=Artificer}"
					],
					"rows": [
						[
							2,
							0,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							3,
							0,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							2,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							2,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							1,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							2,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							1,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							1,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							1,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							1,
							1
						],
						[
							4,
							3,
							3,
							3,
							3,
							1,
							1,
							1,
							1
						],
						[
							4,
							3,
							3,
							3,
							3,
							2,
							1,
							1,
							1
						],
						[
							4,
							3,
							3,
							3,
							3,
							2,
							2,
							1,
							1
						]
					]
				}
			],
			"startingProficiencies": {
				"armor": [
					"light",
					"medium",
					"shields"
				],
				"weapons": [
					"simple",
					"hand crossbows"
				],
				"tools": [
					"Artificer's tools"
				],
				"skills": {
					"choose": 3,
					"from": [
						"Arcana",
						"History",
						"Insight",
						"Investigation",
						"Perception"
					]
				}
			},
			"startingEquipment": {
				"additionalFromBackground": true,
				"default": [
					"a simple weapon",
					"(a) leather armor or (b) chain mail",
					"(a) a light crossbow and 20 bolts or (b) a shield",
					"Artificer's tools",
					"An Inventor's pack",
					"Raw materials required to make custom spellcasting foci that do not have a cost"
				]
			},
			"multiclassing": {
				"requirements": {
					"int": 13
				},
				"proficienciesGained": {
					"armor": [
						"light",
						"medium"
					],
					"weapons": [
						"simple"
					]
				}
			},
			"classFeatures": [
				[
					{
						"name": "Spellcasting",
						"entries": [
							"You approach the study of arcane arts differently from a wizard. While they research to control the essence of magic with speech and gesture, you experiment with ways to infuse magic's arcane threads through the physical world around you. You cast spells a bit differently from other spellcasters, (see Custom Spellcasting Focus and Jury-Rigged Rituals below), but you follow the general rules of spellcasting as detailed in {@book chapter 10 of the Player's Handbook|PHB|10}.",
							{
								"type": "entries",
								"name": "Cantrips",
								"entries": [
									"At 1st level, you know three cantrips of your choice from the artificer spell list. You learn additional artificer cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Artificer table."
								]
							},
							{
								"type": "entries",
								"name": "Preparing and Casting Spells",
								"entries": [
									"The Artificer table shows how many spell slots you have to cast your {@filter artificer spells|spells|class=artificer} of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
									"You prepare the list of artificer spells that are available for you to cast, choosing from the artificer spell list. When you do so, choose a number of artificer spells equal to your Intelligence modifier + your artificer level (minimum of one spell). The spells must be of a level for which you have spell slots.",
									"For example, if you are a 3rd-level artificer, you have four 1st-level and two 2nd-level spell slots. With a Intelligence of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell {@spell cure wounds}, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
									"You can change your list of prepared spells when you finish a long rest. Preparing a new list of artificer spells requires time spent in contemplation and brainstorming: at least 1 minute per spell level for each spell on your list."
								]
							},
							{
								"type": "entries",
								"name": "Spellcasting Ability",
								"entries": [
									"Intelligence is your spellcasting ability for your artificer spells. The power of your spells comes from your devotion to your deity. You use your Intelligence whenever a artificer spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a artificer spell you cast and when making an attack roll with one.",
									{
										"type": "abilityDc",
										"name": "Spell",
										"attributes": [
											"int"
										]
									},
									{
										"type": "abilityAttackMod",
										"name": "Spell",
										"attributes": [
											"int"
										]
									}
								]
							},
							{
								"type": "entries",
								"name": "Jury-rigged Rituals",
								"entries": [
									"You can cast an artificer spell as a ritual if that spell has the ritual tag and you have the spell prepared.",
									"When you cast a ritual, it is less of a ceremonious affair and more a scramble to create a temporary magic item to activate the spell's effect. When you cast a spell as a ritual, there is a special requirement cost to cast it; objects, supplies, and raw materials worth at least 10 gold per spell level. These supplies are not expended in casting the ritual and can be salvaged and reused for later rituals."
								]
							},
							{
								"type": "entries",
								"name": "Custom Spellcasting Focus",
								"entries": [
									"You cannot fulfill the material component of artificer spells you cast, unless they have a notable cost. Instead, you use any type of Artisan's tools (usually Artificer's tools) to construct an improvised device that produces the spell's effect, functioning as a spellcasting focus. Constructing this device is part of the casting time of the spell and counts as the spell's somatic components. An artificer must have both hands free to construct a custom spellcasting focus.",
									"Your custom device can be reused the next time you cast the same spell it was constructed for, unless the spell specifies that its material component is consumed. In that case, the custom spellcasting focus falls apart after the spell's duration is over (or immediately for spells with an instantaneous duration). Reusing a custom spellcasting focus requires only one hand for casting a spell. Drawing a previously made custom spellcasting focus and stowing it are part of casting time of the spell."
								]
							}
						]
					},
					{
						"name": "Master of Artifice",
						"entries": [
							"Your proficiency bonus is doubled for any ability checks you make using the Arcana skill or Artificer's tools.",
							"In addition, choose one field of the artificer's arts that you have focused in above all others. Each field of mastery is detailed at the end of the class description. Your choice grants you additional artificer spells and other features when you choose it at 1st level. It also grants you additional ways to use your Infusions when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.",
							{
								"type": "entries",
								"name": "Mastery Spells",
								"entries": [
									"Each field of mastery has a list of spells—its mastery spells—that you gain at the artificer levels noted in the mastery description. Once you gain a mastery spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day.",
									"If you have a mastery spell that doesn't appear on the artificer spell list, the spell is nonetheless a artificer spell for you."
								]
							}
						],
						"gainSubclassFeature": true
					}
				],
				[
					{
						"name": "Infusions (1/rest)",
						"entries": [
							"At 2nd level, you gain the ability to shape magic energy directly from the world around you to create magical effects. You start with one such effect: Personal Weapon Augmentation. When you reach 2nd level, you also gain an effect determined by your field of mastery. At 5th level, you gain the Instant Armor Augmentation effect. Some fields of mastery also grant additional Infusions as you advance in levels, as noted in the mastery description.",
							"When you use your Infusions, you choose which effect to create. You must then finish a short or long rest to use your Infusions again.",
							"Some Infusion effects require saving throws. When you use such an effect from this class, the DC equals your artificer spell save DC.",
							"At 6th, 14th, and 18th level, you can use your Infusions an additional time between rests. When you finish a short or long rest, you regain your expended uses.",
							{
								"type": "entries",
								"name": "Personal Weapon Augmentation",
								"entries": [
									"As either an action or a bonus action, you may enhance a weapon you are holding. If you enhance a weapon with the ammunition property, it confers any augmentation to ammunition loaded and fired from it. For the 10 minutes or until you let go of the weapon, you gain one of the following benefits:",
									{
										"type": "list",
										"items": [
											{
												"name": "Disrupting Weapon",
												"entries": [
													"+{@dice 1d6} radiant damage, sheds bright light in 20-foot radius and dim light in an additional 20 feet."
												]
											},
											{
												"name": "Flame Tongue",
												"entries": [
													"+{@dice 1d6} fire damage, and you gain fire resistance."
												]
											},
											{
												"name": "Frost Brand",
												"entries": [
													"+{@dice 1d6} cold damage, and you gain cold resistance."
												]
											}
										]
									}
								]
							}
						]
					},
					{
						"name": "Mastery feature",
						"entries": [
							"At 2nd level, you gain a feature from your Mastery."
						],
						"gainSubclassFeature": true
					}
				],
				[],
				[
					{
						"name": "Ability Score Improvement",
						"entries": [
							"When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
							"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
						]
					}
				],
				[
					{
						"name": "Infusion: Armor Augmentation",
						"entries": [
							"Starting at 5th level, you can use an Infusion to enhance an outfit or suit of armor that you touch, just in the nick of time. As either an action or reaction, you can select one of the following benefits. The Infusion lasts for 10 minutes. If you are using the Infusion as a reaction, you may only do so when you or an ally you can see within 5 feet of you are hit by an attack or are affected by a spell, and the wearer of the outfit or suit of armor gains its benefit against the triggering attack or spell.",
							{
								"type": "list",
								"items": [
									{
										"name": "Resonant Harmonics",
										"entries": [
											"The wearer gains thunder resistance and an area with a radius of 5 feet around them ignores the effects of magical silence."
										]
									},
									{
										"name": "Force Ward",
										"entries": [
											"The wearer gains force resistance and if an effect moves the wearer against their will (including the triggering effect), the distance they are moved is reduced by up to 10 feet."
										]
									},
									{
										"name": "Vital Seal",
										"entries": [
											"The wearer gains necrotic resistance and their hit point maximum cannot be reduced by an attack that deals necrotic damage."
										]
									}
								]
							}
						]
					}
				],
				[
					{
						"name": "Infusions (2/rest)",
						"entries": [
							"Beginning at 6th level, you can use your Infusion twice between rests."
						]
					},
					{
						"name": "Mastery feature",
						"entries": [
							"At 6th level, you gain a feature from your Mastery."
						],
						"gainSubclassFeature": true
					}
				],
				[],
				[
					{
						"name": "Ability Score Improvement",
						"entries": [
							"When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
							"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
						]
					},
					{
						"name": "Mastery feature",
						"entries": [
							"At 8th level, you gain a feature from your Mastery."
						],
						"gainSubclassFeature": true
					}
				],
				[],
				[
					{
						"name": "Salvage Schema",
						"entries": [
							"Beginning at 10th level, you may spend one workday of downtime to dismantle a magic item and reverse engineer the schema necessary to create it (see the rules for creating magic items starting on page 46 of the Wayfinder's Guide to Eberron for more about schema).",
							"You record the schema in a series of symbolic notations that only makes sense to yourself and other artificers. (Many accomplished artificers maintain a book of schema that they safeguard against theft or duplication from rival artificers.)",
							"The item you dismantle is destroyed, and the physical components used to make it cannot be reused. Artifacts, cursed items, sentient items, and constructs cannot be dismantled.",
							"At 20th level, you can dismantle a magic item in such a way that you can reassemble it within the same workday you spent dismantling it, reverse engineering its formula without destroying the original item."
						]
					}
				],
				[],
				[
					{
						"name": "Ability Score Improvement",
						"entries": [
							"When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
							"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
						]
					}
				],
				[],
				[
					{
						"name": "Infusions (3/rest)",
						"entries": [
							"Beginning at 14th level, you can use your Infusion three times between rests."
						]
					}
				],
				[],
				[
					{
						"name": "Ability Score Improvement",
						"entries": [
							"When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
							"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
						]
					}
				],
				[
					{
						"name": "Mastery feature",
						"entries": [
							"At 17th level, you gain a feature from your Mastery."
						],
						"gainSubclassFeature": true
					}
				],
				[
					{
						"name": "Infusions (4/rest)",
						"entries": [
							"Beginning at 18th level, you can use your Infusion four times between rests."
						]
					}
				],
				[
					{
						"name": "Ability Score Improvement",
						"entries": [
							"When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
							"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
						]
					}
				],
				[
					{
						"name": "Salvage Schema Improved",
						"entries": [
							"At 20th level, you can dismantle a magic item in such a way that you can reassemble it within the same workday you spent dismantling it, reverse engineering its formula without destroying the original item."
						]
					}
				]
			],
			"subclassTitle": "Mastery",
			"subclasses": [
				{
					"name": "Alchemical Mastery",
					"shortName": "Alchemy",
					"source": "KCAA",
					"page": 46,
					"subclassFeatures": [
						[
							{
								"name": "Alchemical Mastery",
								"entries": [
									"Artificers who focus on mastering alchemy continuously mix and concoct strange potions and substances, experimenting to improve formulas for their strange solutions.",
									{
										"type": "table",
										"caption": "Alchemical Mastery Spells",
										"colLabels": [
											"Artificer Level",
											"Spells"
										],
										"colStyles": [
											"col-3 text-align-center",
											"col-9"
										],
										"rows": [
											[
												"1st",
												"{@spell chromatic orb}, {@spell grease}"
											],
											[
												"3rd",
												"{@spell heat metal}, {@spell Melf's acid arrow}"
											],
											[
												"5th",
												"{@spell transmute weapon|KCAA}, {@spell stinking cloud}"
											],
											[
												"7th",
												"{@spell fire shield}, {@spell stoneskin}"
											],
											[
												"9th",
												"{@spell transmute rock|XGE}, {@spell wall of stone}"
											]
										]
									},
									{
										"type": "entries",
										"name": "Full Alchemist",
										"entries": [
											"At 1st level, you gain proficiency with alchemist's supplies, and your proficiency bonus is doubled for any ability checks you make using them.",
											"Additionally, you have mastered three formulas for the creation of alchemical items. You know the formula for brewing alchemist's fire and the formulas to brew or transmute two additional kinds of items of your choice: antitoxin, alchemical acid, alchemical frost, alchemical lightning, explosive oil, oil of repair, potions of healing, smoke sticks, sunrods, tanglefoot bags, or thunderstones.",
											"To craft an alchemical item, you require one workday (8 hours) of downtime and a set of alchemist's supplies, plus additional raw materials worth half of the item's market price in gold pieces. Items you create this way are nonmagical, except for oils of repair and potions of healing.",
											"Unlike store-bought items, if an alchemical item you create requires a saving throw to resist any of its effects, the DC is 8 + your proficiency bonus + your Intelligence modifier (using your proficiency bonus and Intelligence modifier at the time you created the item).",
											"As you grow in level, your alchemical knowledge grows more refined as well, allowing you to increase the potency of some items you create. If the item's effect involves dice, it gains an additional die at artificer levels 3rd, 5th, 7th, 9th, 11th, 13th, 15th, 17th, and 19th when you create it. (For instance, basic alchemical acid deals 1d6 acid damage, but if you are 13th level, any alchemical acid you create can deal 7d6 acid damage).",
											"For each additional dice an item's effect has, you need to spend one extra workday and an additional 25% of its market value in gold pieces to craft it. You can choose to create an alchemical item that is less potent than the maximum potency you are capable of creating.",
											"If a creature other than you employs an alchemical item you create with greater than normal effects, it retains its increased potency."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Infusion: Instant Alchemy",
										"entries": [
											"Starting at 2nd level, you can use an Infusion to transmute a harmless liquid or object into an alchemical concoction or item as an action. You can create any nonmagical alchemical item you know the formula for.",
											"Any item you create is created at your maximum potency. The item retains its new properties for 10 minutes, or until used."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Expanded Knowledge",
										"entries": [
											"At 6th level, you learn two additional formulas for creating alchemical items, picked from among those available to you at 1st level."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Forbidden Formulas",
										"entries": [
											"At 8th level, your experiments or reverse engineering have unlocked the secrets of dangerous alchemical formulas not typically available on the market. You learn how to create two alchemical items from the following list: absentia, alchemical wrath, dragon's blood (black), dragon's blood (blue). All of these items are nonmagical."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Master Alchemist",
										"entries": [
											"Starting at 17th level, you learn two additional formulas for creating alchemical items, picked from among those available to you at 1st or 8th level, and the following list: dragon's blood (red), goodberry wine.",
											"Of these options, goodberry wine is considered a magical item."
										]
									}
								]
							}
						]
					]
				},
				{
					"name": "Automation Mastery",
					"shortName": "Automation",
					"source": "KCAA",
					"page": 47,
					"subclassFeatures": [
						[
							{
								"name": "Automation Mastery",
								"entries": [
									"Some artificers are focused on the nature of constructs and hone their intellect toward repairing, maintaining, and creating them. They are typically hardier than other artificers, often wading into battle beside their signature homunculi.",
									{
										"type": "table",
										"caption": "Automation Mastery Spells",
										"colLabels": [
											"Artificer Level",
											"Spells"
										],
										"colStyles": [
											"col-3 text-align-center",
											"col-9"
										],
										"rows": [
											[
												"1st",
												"{@spell cause damage|KCAA}, {@spell repair damage|KCAA}"
											],
											[
												"3rd",
												"{@spell magic weapon}, {@spell methods of repair|KCAA}"
											],
											[
												"5th",
												"{@spell mass emergency repairs|KCAA}, {@spell reactivate|KCAA}"
											],
											[
												"7th",
												"{@spell death ward}, {@spell stoneskin}"
											],
											[
												"9th",
												"{@spell mass repair damage|KCAA}, {@spell reconstruct|KCAA}"
											]
										]
									},
									{
										"type": "entries",
										"name": "Bonus Proficiencies",
										"entries": [
											"At 1st level, you gain proficiency with heavy armor."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Infusion: Construct Lock",
										"entries": [
											"Starting at 2nd level, you can use an Infusion to force a construct or warforged to temporarily cease all functions. As an action, you cause one construct or warforged that can see you within 30 feet of you to make a Wisdom saving throw. If the target fails its saving throw, it is affected by this ability for 1 minute.",
											"While it is affected by this Infusion, the target can take no actions or reactions and it automatically fails Strength and Dexterity saving throws. Additionally, attack rolls against it have advantage, and any attack that hits the target is a critical hit if the attacker is within 5 feet of it. At the end of each of its turns, the target can repeat the saving throw. On a success, this effect ends."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Signature Homunculus",
										"entries": [
											"Starting at 6th level, you gain the ability to invest a construct with a portion of your soul, binding it to you as a homunculus. You must spend four workweeks of downtime and 500 gold to construct one. Choose a construct creature no larger than Medium and that has a challenge rating of 1/4 or lower. After construction is complete, you imbue the construct with a portion of your soul, transforming it into a homunculus. Your homunculus shares your alignment.",
											"Your homunculus accompanies you on your adventures and faithfully fights alongside you. Add your proficiency bonus to the homunculus's AC, attack rolls, and damage rolls, as well as to any saving throws and skills it is proficient in. The creature has a total number of hit dice equal to your level, or it's normal total, whichever is higher. For every hit die it has, its hit points increase accordingly. Each level you gain after 6th, your homunculi gains an additional hit die and increases its hit points accordingly.",
											"For every 4 hit die the homunculus has, its ability scores improve. Your homunculus can increase one ability score of your choice by 2, or it can increase two ability scores of your choice by 1. As normal, your homunculus can't increase an ability score above 20 using this feature unless its description specifies otherwise. Your homunculus can't gain feats unless otherwise noted.",
											"Your homunculus obeys your commands as best it can. It rolls for initiative like any other creature, but you determine its actions, decisions, attitudes, and so on. If you are incapacitated, your companion acts on its own.",
											"Your homunculus remains active as long as it is within 100 feet of you. It becomes unconscious and inert if you ever move further away. If your homunculus is destroyed, a piece of your soul is lost and you suffer a–4 penalty to attack rolls, saving throws, and ability checks. Every time you complete a long rest, this penalty lessens by 1. Once you no longer have this penalty, you can craft a new homunculus by spending another four workweeks of downtime and 500 gold.",
											"You cannot have more than one signature homunculus active at a time. Should you begin crafting a new signature homunculus, the old one collapses into wasted raw materials after you finish one workday of progress toward crafting the new one (and you suffer the penalty above, since the old homunculus is destroyed). However, if you select the {@feat Craft Homunculus|KCAA} feat (described in a later chapter), you can craft a second homunculus and have both it and your signature homunculus active at the same time.",
											"Homunculi you create with the create homunculus spell from Xanathar's Guide to Everything do not count toward this limit, and vice versa."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Synchronicity",
										"entries": [
											"At 8th level, when you use the Attack action on your turn, if your signature homunculus can see you, it can use its reaction to make a melee attack. Additionally, while your signature homunculus can see you, it has advantage on all saving throws."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Masterpiece",
										"entries": [
											"At 17th level, you complete your final adjustments to your signature homunculus. Pick one of the following features for your signature homunculus. In gains the selected feature permanently. Once you make your choice, you cannot change it unless you construct a new signature homunculus.",
											{
												"type": "list",
												"items": [
													{
														"name": "Adamantine Defense",
														"entries": [
															"Your signature homunculus has resistance to all damage."
														]
													},
													{
														"name": "Amalagamate Essence",
														"entries": [
															"When you use an infusion on yourself or cast a spell targeting yourself, you can also affect your signature homunculus with the infusion or spell if the homunculus is within 30 feet of you."
														]
													},
													{
														"name": "Mithral Wings",
														"entries": [
															"Your signature homunculus gains a fly speed of 60 feet, or its existing fly speed increases by 30 feet. While flying, it can hover. In addition, your signature homunculus doesn't provoke opportunity attacks when it flies out of an enemy's reach."
														]
													},
													{
														"name": "Quicksilver Fury",
														"entries": [
															"Your signature homunculus can use its Action to make two melee weapon attacks against a single creature, or one melee weapon attack against each creature of its choice within 5 feet of it, with a separate attack roll for each target."
														]
													}
												]
											}
										]
									}
								]
							}
						]
					]
				},
				{
					"name": "Elemental Mastery",
					"shortName": "Elemental",
					"source": "KCAA",
					"page": 49,
					"subclassFeatures": [
						[
							{
								"name": "Automation Mastery",
								"entries": [
									"The secrets of elemental binding are behind some of the most famous inventions of Khorvaire's artificers, including the wondrous lightning rail and elemental airships of House Orien and House Lyrandar. Masters of elemental binding channel the primal power of conjured elementals into their works of artifice to enhance and empower them.",
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Restriction",
												"entries": [
													"You must know the secrets of elemental binding to select this mastery. Currently, the techniques to bind elementals are known only to the gnomes of Zilargo and the Sulatar drow, but with the DM's permission, it is possible that someone might be taught by an individual from these cultures or discover the art on their own. However, the Zil and Sulatar would both be very concerned if their secrets were to be \"stolen\"."
												]
											}
										]
									},
									{
										"type": "table",
										"caption": "Elemental Mastery Spells",
										"colLabels": [
											"Artificer Level",
											"Spells"
										],
										"colStyles": [
											"col-3 text-align-center",
											"col-9"
										],
										"rows": [
											[
												"1st",
												"{@spell absorb elements|XGE}, {@spell conjure elemental mote|KCAA}"
											],
											[
												"3rd",
												"{@spell arcane lock}, {@spell locate object}"
											],
											[
												"5th",
												"{@spell elemental weapon}, {@spell magic circle}"
											],
											[
												"7th",
												"{@spell conjure minor elementals}, {@spell charm monster|XGE}"
											],
											[
												"9th",
												"{@spell conjure elemental}, {@spell planar binding}"
											]
										]
									},
									{
										"type": "entries",
										"name": "Bonus Starting Equipment",
										"entries": [
											"Artificers with a mastery in binding elementals begin the game with a single Khyber dragonshard worth 50 gp, sufficient for the material component of the conjure elemental mote spell."
										]
									},
									{
										"name": "Advanced Mote Conjuring",
										"entries": [
											"Starting at 1st level, whenever you cast {@spell conjure elemental mote|KCAA}, the conjured mote's hit point maximum increases by 3 for every artificer level you have.",
											"Additionally, the mote gains an extra dice of its damage on its damage rolls when you reach 5th level, and then an additional extra die at 11th and 17th level. (For example, at 11th level, an air mote you conjure would deal 3d4 + 3 lightning damage with its Discharge attack.)",
											"Finally, should the elemental mote be reduced to 0 hit points, as a reaction you may attempt an Arcana check with a DC equal to 10 + the damage of the attack that reduced the elemental mote to 0 hit points. If your check succeeds, the elemental mote is still destroyed, but the khybershard at its core does not burn out, retaining its worth so it can be reused as the material component for conjure elemental mote again."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Infusion: Elemental Reconstitution",
										"entries": [
											"Starting at 2nd level, you can use an Infusion to cause a damaged elemental creature to begin reconstituting its form. Choose one elemental creature that doesn't have all of its hit points you can see within 30 feet. For 1 minute, that elemental creature heals an amount of hit points at the start of its turn equal to your Intelligence modifier, unless the creature has more than half of its hit points."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Defensive Elemental Binding",
										"entries": [
											"At 6th level, you have devised how to channel bound elemental motes into a protective matrix around a suit of armor. If you have summoned an elemental mote and have taken an action to suppress it into its khybershard core, you may spend one workday of downtime (8 hours) integrating the khybershard into any suit of armor. While integrated this way, the khybershard cannot be targeted separately, and the elemental bound inside it has total cover against all spells and effects.",
											"When worn, the augmented suit of armor functions as {@item armor of resistance}, granting the wearer resistance to one type of damage the bound elemental is resistant or immune to itself (your choice, made at the time you finish integrating the khybershard into the armor).",
											"The elemental mote still exists, and you cannot summon another one while it and the armor remain intact. You may spend an additional workday of downtime to safely remove the elemental's khybershard from the armor, restoring it to elemental mote form."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Offensive Elemental Binding",
										"entries": [
											"At 8th level, you have perfected the techniques for binding elemental motes into weapons, channeling the primal magic of their element for offensive power. If you have summoned an elemental mote and have taken an action to suppress it into its khybershard core, you may spend 8 hours integrating the khybershard into any weapon. While integrated this way, the khybershard cannot be targeted separately, and the elemental bound inside it has total cover against all spells and effects.",
											"The elementally bound weapon is as a magical weapon, and gains an additional effect depending on the nature of the bound elemental mote as follows:",
											{
												"type": "list",
												"items": [
													{
														"type": "entries",
														"name": "Air Mote",
														"entries": [
															"The weapon deals an extra {@dice 1d6} lightning damage on each hit."
														]
													},
													{
														"type": "entries",
														"name": "Earth Mote",
														"entries": [
															"The wielder of the weapon gains a +2 bonus on damage rolls made with it."
														]
													},
													{
														"type": "entries",
														"name": "Fire Mote",
														"entries": [
															"The weapon deals an extra {@dice 1d6} fire damage on each hit."
														]
													},
													{
														"type": "entries",
														"name": "Water Mote",
														"entries": [
															"The weapon deals an extra {@dice 1d6} cold damage on each hit."
														]
													}
												]
											},
											"Ranged weapons confer these bonuses to their ammunition.",
											"The elemental mote still exists, and you cannot summon another one while it and the weapon remain intact. You may spend an additional workday of downtime to safely remove the elemental's khybershard from the weapon, restoring it to elemental mote form."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Elemental Binding Master",
										"entries": [
											"Starting at 17th level, you have mastered elemental binding. You may now incorporate any conjured elemental you have bound to a khybershard into elementally empowered items.",
											"When binding an elemental mote to a suit of armor or a weapon, you can make the binding permanent if you spend an additional workday of downtime enhancing the binding, along with additional raw materials worth 1,000 gp. If the binding becomes permanent, the elemental spirit is no longer considered your conjured mote for the conjure elemental mote spell, allowing you to conjure another one without dismissing the permanently bound spirit back to its home plane.",
											"If you bind an elemental creature other than an elemental mote (see sidebar), you can incorporate its khybershard into a suit of armor or weapon, requiring a number of workweeks of downtime equal to twice the elemental's challenge rating and additional raw materials equal to 1,000 gp times the elemental's challenge rating.",
											"When binding an elemental other than an elemental mote to a suit of armor, the armor now grants all of the elemental's resistances and immunities to the armor's wearer.",
											"When binding an elemental other than an elemental mote to a weapon, the weapon gains magical properties, depending on the nature of the elemental bound to the weapon:",
											{
												"type": "list",
												"items": [
													{
														"type": "entries",
														"name": "Elemental Air Creature",
														"entries": [
															"The weapon gains the properties of a {@item dancing sword}, even if the weapon is not a sword."
														]
													},
													{
														"type": "entries",
														"name": "Elemental Earth Creature",
														"entries": [
															"The wielder of the weapon has a +2 bonus to attack and damage rolls made with it."
														]
													},
													{
														"type": "entries",
														"name": "Elemental Fire Creature",
														"entries": [
															"The wielder of the weapon has a +1 bonus to attack rolls made with it, and the weapon deals 2d6 extra fire damage on a hit."
														]
													},
													{
														"type": "entries",
														"name": "Elemental Water Creature",
														"entries": [
															"The wielder of the weapon has a +1 bonus to attack rolls with it, and the weapon deals 2d6 extra cold damage on a hit."
														]
													}
												]
											},
											"Additionally, you can create additional elemental items. Many of these require a team of apprentice elemental binders, such as is the case with the creation of House Lyrandar's elemental airships, which require months of painstaking work from teams of artificers, shipwrights, and engineers, in addition to your elemental binding mastery.",
											"A single item can only have one elemental bound to it (except under exceptional circumstances, such as the famed Golden Dragon, an elemental airship so large it requires two bound elementals to function)."
										]
									}
								]
							}
						]
					]
				},
				{
					"name": "Innovation Mastery",
					"shortName": "Innovation",
					"source": "KCAA",
					"page": 51,
					"subclassFeatures": [
						[
							{
								"name": "Innovation Mastery",
								"entries": [
									"Artificers who focus on mastering innovation constantly strive to create new inventions and better ways to use existing ones.",
									{
										"type": "table",
										"caption": "Innovation Mastery Spells",
										"colLabels": [
											"Artificer Level",
											"Spells"
										],
										"colStyles": [
											"col-3 text-align-center",
											"col-9"
										],
										"rows": [
											[
												"1st",
												"{@spell identify}, {@spell spell-storing item|KCAA}"
											],
											[
												"3rd",
												"{@spell enhance ability}, {@spell spiritual weapon}"
											],
											[
												"5th",
												"{@spell bestow curse}, {@spell remove curse}"
											],
											[
												"7th",
												"{@spell fabricate}, {@spell stone shape}"
											],
											[
												"9th",
												"{@spell Bigby's hand}, {@spell creation}"
											]
										]
									},
									{
										"type": "entries",
										"name": "Bonus Cantrip",
										"entries": [
											"At 1st level, you learn the {@spell improvised wand} cantrip. When you do, you know 3 energy types with which to use it, instead of the normal 2."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Infusion: Perfect Tool",
										"entries": [
											"Starting at 2nd level, you can use an Infusion to temporarily modify an object with conjured additions and attachments that make it the perfect tool for whatever situation you are dealing with. As an action, choose one skill or tool. For the next 10 minutes (and as long as you have the object) you have proficiency with the chosen skill or tool."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Infusion: Rapid Invention",
										"entries": [
											"At 6th level, you can use an infusion in place of using your Inspiration or spending Hit Dice to reduce the casting time of {@spell spell-storing item|KCAA} to 1 action, no matter what spell level you cast it from."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Intuitive Design",
										"entries": [
											"At 8th level, your design philosophy for your inventions becomes more intuitive, allowing creatures less knowledgeable than yourself to understand and use your creations. You gain the following benefits:",
											{
												"type": "list",
												"items": [
													"When you use an Infusion to make a Perfect Tool, anyone can benefit from the object for the duration of the effect so long as they hold and use the Perfect Tool.",
													"When you cast {@spell spell-storing item|KCAA}, any creature can activate the item to cast the spell you store in it."
												]
											}
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Magnum Opus",
										"entries": [
											"Starting at 17th level, you have the opportunity to create a singularly impressive magic item. If you have Inspiration, you may use it to spend one workweek of downtime to create a magic item of up to legendary rarity at no cost and without a schema or rare component. (Your DM has a list of appropriate magic items, such as those found in the Dungeon Master's Guide. You can also work with your DM to create a brand-new magic item.) You may only create one magic item this way; it is your finest invention."
										]
									}
								]
							}
						]
					]
				},
				{
					"name": "Renegade Mastery",
					"shortName": "Renegade",
					"source": "KCAA",
					"page": 51,
					"subclassFeatures": [
						[
							{
								"name": "Renegade Mastery",
								"entries": [
									"Renegade artificers are driven by a devotion to—or some would say obsession with—self-improvement. These artificers are called renegades because they ignore conventional wisdom and experiment upon themselves, improving their bodies by implanting and replacing parts of themselves with the products of their mad genius.",
									{
										"type": "table",
										"caption": "Renegade Mastery Spells",
										"colLabels": [
											"Artificer Level",
											"Spells"
										],
										"colStyles": [
											"col-3 text-align-center",
											"col-9"
										],
										"rows": [
											[
												"1st",
												"{@spell repair damage|KCAA}, {@spell thunderous smite}"
											],
											[
												"3rd",
												"{@spell magic weapon}, {@spell methods of repair|KCAA}"
											],
											[
												"5th",
												"{@spell blinding smite}, {@spell mass emergency repairs|KCAA}"
											],
											[
												"7th",
												"{@spell staggering smite}, {@spell stoneskin}"
											],
											[
												"9th",
												"{@spell steel wind strike|XGE}, {@spell mass repair damage|KCAA}"
											]
										]
									},
									{
										"type": "entries",
										"name": "Bionic Arm",
										"entries": [
											"At 1st level, you have taken the first major leap in your quest for self-improvement, something that clearly announced your lack of limits and marks you as a renegade. You replace one of your arms with a constructed prosthesis you refer to as a bionic arm. When you make an unarmed strike with your bionic arm, you deal bludgeoning damage equal to {@dice 1d8} + your Strength modifier."
										]
									},
									{
										"type": "entries",
										"name": "Repair Mastery",
										"entries": [
											"Also starting at 1st level, your repair spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a construct or warforged, the target regains additional hit points equal to 2 + the spell's level."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Infusion: Self Repair",
										"entries": [
											"Starting at 2nd level, you can use an Infusion to activate devices you've implanted in your body to repair yourself. As an action, you cause yourself to begin automatically repairing damage for 1 minute. For this duration, at the start of each of your turns, you regain a number of hit points equal to your Intelligence modifier, to a maximum of half of your normal hit point total."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Supporting Construction",
										"entries": [
											"At 6th level, you have replaced so much of yourself with artificial components that your hit point maximum increased by 6 and increases by 1 whenever you gain another level in the artificer class. These artificial replacements also cause you to count as both a construct and a humanoid. You can be affected by a game effect if it works on either of your creature types.",
											"Additionally, you may attune to and attach warforged component magic items, even if you are not a warforged, so long as they do not require a specific warforged model type."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Bionic Improvement",
										"entries": [
											"At 8th level, you have woven countless infusions and layered numerous magical improvements into your bionic arm. At your option, you may replace your other arm with a second bionic arm as well. Whether you have one bionic arm or two, you gain the same benefits:",
											{
												"type": "list",
												"items": [
													"Your bionic arm(s) now count as magical weapons.",
													"When you make an unarmed strike with a bionic arm you have a +1 bonus to attack and damage rolls.",
													"Your bionic arm(s) are reinforced with extra plating. They function as the equivalent of a +1 magical shield, granting you a +3 bonus to Armor Class. This does not limit your ability to hold objects, cast spells, or wield weapons.",
													"When you take the Attack action on your turn to make an unarmed strike with a bionic arm, you can make another unarmed strike as a bonus action."
												]
											}
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Construct Exemplar",
										"entries": [
											"At 17th level, you have achieved your vision of perfection for yourself. If you are a warforged, any critical hit against you is treated as a normal hit. If you are any other kind of creature, you gain the Model Type and Remodeling racial traits of the {@race warforged|KCAA}. You may now attune to warforged components that require the model type that you chose for the Model Type trait.",
											"No matter what kind of creature you were, you are no longer considered a humanoid, and are a construct only. You cannot be targeted by spells or affects that specifically target humanoids (such as {@spell dominate person}), and you cannot be affected by spells that explicitly exclude constructs (such as {@spell cure wounds})."
										]
									}
								]
							}
						]
					]
				},
				{
					"name": "Spellcraft Mastery",
					"shortName": "Spellcraft",
					"source": "KCAA",
					"page": 53,
					"subclassFeatures": [
						[
							{
								"name": "Spellcraft Mastery",
								"entries": [
									"Some artificers focus on the crafting of spells instead of objects. They have a wider breadth of study concerning spellcasting, and usually have access to more directly devastating magic. Experienced artificers in this field can perceive the fundamental building blocks of the spells, rearranging them with improvisational alterations on the fly.",
									{
										"type": "table",
										"caption": "Spellcraft Mastery Spells",
										"colLabels": [
											"Artificer Level",
											"Spells"
										],
										"colStyles": [
											"col-3 text-align-center",
											"col-9"
										],
										"rows": [
											[
												"1st",
												"{@spell detect magic}, {@spell thunderwave}"
											],
											[
												"3rd",
												"{@spell scorching ray}, {@spell hold person}"
											],
											[
												"5th",
												"{@spell fireball}, {@spell lightning bolt}"
											],
											[
												"7th",
												"{@spell fire shield}, {@spell phantasmal killer}"
											],
											[
												"9th",
												"{@spell telekinesis}, {@spell cone of cold}"
											]
										]
									},
									{
										"type": "entries",
										"name": "Bonus Cantrip",
										"entries": [
											"At 1st level, you learn one wizard cantrip of your choice. It counts as an artificer cantrip for you."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Infusion: Energy Modulation",
										"entries": [
											"Starting at 2nd level, as part of the casting time of casting a spell, you can expend an Infusion to alter the spell's formula as you cast it.",
											"When you cast a spell with a spell slot and the spell deals acid, cold, fire, lightning, poison, or thunder damage, you can substitute that damage type with one other type from that list (you can change only one damage type per casting of a spell)."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Infusion: Arcane Alteration",
										"entries": [
											"At 6th level, as part of the casting time of casting a non-abjuration or non-divination spell, you can spend an infusion to change the basic nature of a spell, changing its school of magic into any other school, except abjuration or divination.",
											"If you change the spell's school and it requires a saving throw to resist its affects, the spell's saving throw changes depending on its new school of magic:",
											{
												"type": "list",
												"items": [
													{
														"type": "entries",
														"name": "Conjuration",
														"entries": [
															"Strength."
														]
													},
													{
														"type": "entries",
														"name": "Enchantment",
														"entries": [
															"Wisdom."
														]
													},
													{
														"type": "entries",
														"name": "Evocation",
														"entries": [
															"Dexterity."
														]
													},
													{
														"type": "entries",
														"name": "Illusion",
														"entries": [
															"Intelligence."
														]
													},
													{
														"type": "entries",
														"name": "Necromancy",
														"entries": [
															"Charisma."
														]
													},
													{
														"type": "entries",
														"name": "Transmutation",
														"entries": [
															"Constitution."
														]
													}
												]
											},
											"If the spell normally has a reduced effect even on a successful saving throw, the changed spell has no effect if affected creatures succeed on their save. For instance, a {@spell fireball} changed to a conjuration or illusion spell would deal no damage if a creature in its area of effect succeeded on their Strength or Intelligence saving throw, instead of half damage.",
											"The spell's new school must conceivably be able to produce the base spell's effects. If your chosen school cannot do so (such as an illusory {@spell dimension door} that does not actually transport yourself), the spell fails, but you do not expend a spell slot or an Infusion. Work with your DM to determine what the limits of each spell school are, and how far you can stretch a desired spell.",
											"If you have two or more uses of your Infusions remaining, you can expend two uses in order to affect a single spell with both Arcane Alteration and Energy Modulation during its casting time."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Potent Spellcasting",
										"entries": [
											"At 8th level, you add your Intelligence modifier to the damage you deal with any artificer cantrip."
										]
									}
								]
							}
						],
						[
							{
								"entries": [
									{
										"type": "entries",
										"name": "Spellforge",
										"entries": [
											"Starting at 17th level, whenever you prepare your artificer spells, you may select a number of wizard spells to prepare as if they were on the artificer spell list. The maximum number of spells you can prepare this way is equal to your Intelligence modifier."
										]
									}
								]
							}
						]
					]
				}
			]
		}
	]
}
